## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                        NAME                         |
|--------|-----------------------------------------------------|
| update | `aws_glue_crawler.operations_qualtrics_postsupport` |
|        | `aws_s3_object.platform_gc_notify_requirements`     |
| add    | `aws_glue_crawler.operations_qualtrics_postdemo`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_glue_crawler.operations_qualtrics_postdemo will be created
  + resource "aws_glue_crawler" "operations_qualtrics_postdemo" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput = {
                  + Partitions = {
                      + AddOrUpdateBehavior = "InheritFromTable"
                    }
                  + Tables     = {
                      + AddOrUpdateBehavior = "MergeNewColumns"
                    }
                }
              + Version       = 1
            }
        )
      + database_name          = "operations_qualtrics_production"
      + description            = "Classify the Qualtrics PostDemo survey data"
      + id                     = (known after apply)
      + name                   = "Operations / Qualtrics / PostDemo"
      + region                 = "ca-central-1"
      + role                   = "arn:aws:iam::739275439843:role/service-role/AWSGlueCrawler-DataLake"
      + schedule               = "cron(0 6 * * ? *)"
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "operations_qualtrics_postdemo_"
      + tags                   = {
          + "CostCentre" = "PlatformDataLake"
        }
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://cds-data-lake-raw-production/operations/qualtrics/forms/postdemo/"
        }
      + s3_target {
          + path = "s3://cds-data-lake-raw-production/operations/qualtrics/gcds/postdemo/"
        }
      + s3_target {
          + path = "s3://cds-data-lake-raw-production/operations/qualtrics/notify/postdemo/"
        }

      + schema_change_policy {
          + delete_behavior = "DELETE_FROM_DATABASE"
          + update_behavior = "UPDATE_IN_DATABASE"
        }
    }

  # aws_glue_crawler.operations_qualtrics_postsupport will be updated in-place
  ~ resource "aws_glue_crawler" "operations_qualtrics_postsupport" {
        id                     = "Operations / Qualtrics / PostSupport"
        name                   = "Operations / Qualtrics / PostSupport"
        tags                   = {
            "CostCentre" = "PlatformDataLake"
        }
        # (11 unchanged attributes hidden)

      ~ s3_target {
          ~ path                = "s3://cds-data-lake-raw-production/operations/qualtrics/forms/" -> "s3://cds-data-lake-raw-production/operations/qualtrics/forms/postsupport/"
            # (5 unchanged attributes hidden)
        }
      ~ s3_target {
          ~ path                = "s3://cds-data-lake-raw-production/operations/qualtrics/gcds/" -> "s3://cds-data-lake-raw-production/operations/qualtrics/gcds/postsupport/"
            # (5 unchanged attributes hidden)
        }
      ~ s3_target {
          ~ path                = "s3://cds-data-lake-raw-production/operations/qualtrics/notify/" -> "s3://cds-data-lake-raw-production/operations/qualtrics/notify/postsupport/"
            # (5 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_s3_object.platform_gc_notify_requirements will be updated in-place
  ~ resource "aws_s3_object" "platform_gc_notify_requirements" {
      ~ etag                          = "5e2f585db5e1d7854949691853232aaf" -> "1282ac170fefa95242d53a7468047222"
        id                            = "platform/gc_notify/requirements.txt"
        tags                          = {}
      ~ version_id                    = "R7oiz2etubMBdV3sk.fLPFYN5Fdaygqt" -> (known after apply)
        # (25 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_strategic_data_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_strategic_data_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_github_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_github_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_google_analytics_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_google_analytics_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_qualtrics_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_qualtrics_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_design_system"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production_curated"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing...
```

</details>
